BAS BMEKZU Project/src/Documents/ИНАГРО_КорректировкаУслуг/ИНАГРО_КорректировкаУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИНАГРО_КорректировкаУслуг</name>
  <registerRecords>AccumulationRegister.ИНАГРО_РасчетыПоУслугам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Культура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Урожай</name>
    <type>
      <types>CatalogRef.ИНАГРО_ВидыУрожая</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидХранения</name>
    <comment>Вид хранения</comment>
    <type>
      <types>CatalogRef.ИНАГРО_ВидыХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДвиженияФормы36</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ИНАГРО_ВидыДвижений</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Культура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоУчету</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьПоУчету</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Урожай</name>
      <type>
        <types>CatalogRef.ИНАГРО_ВидыУрожая</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидХранения</name>
      <comment>Вид хранения</comment>
      <type>
        <types>CatalogRef.ИНАГРО_ВидыХранения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/Enums/ИНАГРО_ВидыДвижений/ИНАГРО_ВидыДвижений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИНАГРО_ВидыДвижений</name>
  <comment>Я</comment>
  <enumValues>
    <name>Приход</name>
    <comment>Приход</comment>
  </enumValues>
  <enumValues>
    <name>Расход</name>
    <comment>Расход</comment>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Documents/ИНАГРО_КорректировкаУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда  

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);	
	
	ИНАГРО_ЭлеваторЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект);

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения); 	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем Заголовок, СтруктураШапкиДокумента;
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
		   
	// Заголовок Для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
		
	// Движения по документу
	Если НЕ Отказ Тогда		
		ДвиженияПоРегиструРасчетыПоУслугам();
	КонецЕсли;	
		
	ПроведениеСервер.ПодготовитьНаборыЗаписейКЗаписиДвижений(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#Область Проведение

Процедура ДвиженияПоРегиструРасчетыПоУслугам()
	
	ТаблицаУслугПоРасходу = Новый ТаблицаЗначений;
	ТаблицаУслугПоРасходу.Колонки.Добавить("ДатаРасчета");
	ТаблицаУслугПоРасходу.Колонки.Добавить("Ссылка"); 
	ТаблицаУслугПоРасходу.Колонки.Добавить("Организация");
	ТаблицаУслугПоРасходу.Колонки.Добавить("Контрагент");
	ТаблицаУслугПоРасходу.Колонки.Добавить("ДоговорКонтрагента");
	ТаблицаУслугПоРасходу.Колонки.Добавить("Номенклатура");
	ТаблицаУслугПоРасходу.Колонки.Добавить("Культура");
	ТаблицаУслугПоРасходу.Колонки.Добавить("Склад");
	ТаблицаУслугПоРасходу.Колонки.Добавить("Урожай");
	ТаблицаУслугПоРасходу.Колонки.Добавить("ВидХранения");
	ТаблицаУслугПоРасходу.Колонки.Добавить("Количество");
	ТаблицаУслугПоРасходу.Колонки.Добавить("Стоимость");  	 
	
	ТаблицаУслугПоПриходу = ТаблицаУслугПоРасходу.Скопировать();
	
	СформироватьТаблицыУслуг(ТаблицаУслугПоПриходу, ТаблицаУслугПоРасходу);
	
	Если ТаблицаУслугПоРасходу.Количество() > 0 Тогда		
		ИНАГРО_Элеватор.ДвиженияПоРегиструРасчетыПоУслугам(Движения, ТаблицаУслугПоРасходу, "Расход");		
	КонецЕсли;  
	
	Если ТаблицаУслугПоПриходу.Количество() > 0 Тогда		
		ИНАГРО_Элеватор.ДвиженияПоРегиструРасчетыПоУслугам(Движения, ТаблицаУслугПоПриходу, "Приход");		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьТаблицыУслуг(ТаблицаУслугПоПриходу, ТаблицаУслугПоРасходу)
	
	Для Каждого СтрокаТабличнойЧасти Из Услуги Цикл
		
		Если СтрокаТабличнойЧасти.Количество = 0 И СтрокаТабличнойЧасти.Стоимость = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТабличнойЧасти.ВидДвижения = Перечисления.ИНАГРО_ВидыДвижений.Приход Тогда
			НоваяСтрока = ТаблицаУслугПоПриходу.Добавить();
		ИначеЕсли СтрокаТабличнойЧасти.ВидДвижения = Перечисления.ИНАГРО_ВидыДвижений.Расход Тогда 
			НоваяСтрока = ТаблицаУслугПоРасходу.Добавить();
		Иначе 
			Продолжить;
		КонецЕсли;		
		
		НоваяСтрока.ДатаРасчета        = Дата;
		НоваяСтрока.Ссылка             = Ссылка; 
		НоваяСтрока.Организация        = Организация;
		НоваяСтрока.Контрагент         = СтрокаТабличнойЧасти.Контрагент;
		НоваяСтрока.ДоговорКонтрагента = СтрокаТабличнойЧасти.ДоговорКонтрагента;
		НоваяСтрока.Номенклатура       = СтрокаТабличнойЧасти.Номенклатура;
		НоваяСтрока.Культура           = СтрокаТабличнойЧасти.Культура;
		НоваяСтрока.Склад              = СтрокаТабличнойЧасти.Склад;
		НоваяСтрока.Урожай             = СтрокаТабличнойЧасти.Урожай;
		НоваяСтрока.ВидХранения        = СтрокаТабличнойЧасти.ВидХранения;
		НоваяСтрока.Количество         = СтрокаТабличнойЧасти.Количество;
		НоваяСтрока.Стоимость          = СтрокаТабличнойЧасти.Стоимость;
		
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
